import React from 'react';
import styled from 'styled-components';

import dim from '../../Resources/Dimensions';

const Wrapper = styled.div`
  margin: 0 auto;
  width: ${dim.contentMinWidth}px;
  min-width: ${dim.contentMinWidth}px;

  box-shadow: 0 0 10px gray; 

  background: white;
`;

const ContentPresentation = () => {
  return (
    <Wrapper>
      <h1>JAVA에 대해서</h1>
      <h2>영통구대족장</h2>
      <p>풍부하게 들어 구하기 그리하였는가? 열락의 꽃이 풀밭에 기쁘며, 것이다.보라, 것이다. 길을 긴지라 역사를 못할 설산에서 일월과 따뜻한 같으며, 청춘은 사막이다. 곳으로 바이며, 설산에서 것이다.보라, 아름답고 생명을 발휘하기 보는 이 듣는다. 가슴에 별과 싶이 온갖 설산에서 같으며, 구하기 있는가? 만천하의 열락의 반짝이는 얼마나 산야에 곳이 심장은 굳세게 이것이다. 없으면 있는 할지라도 풍부하게 것이다. 위하여서 열락의 밝은 작고 아름다우냐? 가지에 넣는 바이며, 이것이야말로 보이는 맺어, 굳세게 풀이 스며들어 것이다. 천고에 주며, 하는 뜨거운지라, 가지에 밥을 할지니, 이 아니다.<br />
        인간이 따뜻한 때까지 인생의 실현에 무한한 용감하고 있는 것이다. 충분히 같지 착목한는 너의 그들은 못하다 소리다.이것은 사막이다. 원대하고, 없는 불어 인간은 용감하고 만천하의 만물은 영원히 능히 힘있다. 생명을 우리 그들에게 봄바람이다. 그들의 같지 이상의 것이다. 내려온 생의 꽃이 트고, 듣기만 청춘 관현악이며, 황금시대다. 피에 뛰노는 없으면, 피다. 청춘 커다란 인도하겠다는 그러므로 찬미를 가치를 끝까지 이상은 말이다. 이상의 든 더운지라 일월과 새 갑 있으랴? 이상 예가 얼마나 자신과 피가 것이 무엇을 같이, 있는 있다. 창공에 공자는 인생에 황금시대다.<br />
튼튼하며, 반짝이는 청춘 보배를 끝에 미인을 대한 인간의 이것이다. 있으며, 그것을 인생을 이것을 듣는다. 때에, 역사를 노래하며 창공에 충분히 얼마나 칼이다. 이상은 붙잡아 인도하겠다는 꽃이 열매를 할지니, 것이다. 풍부하게 별과 내려온 것이다. 미묘한 할지라도 용감하고 없으면, 심장의 것이다. 가치를 같은 그것을 전인 있다. 자신과 현저하게 대중을 바이며, 피다. 새가 지혜는 소금이라 꾸며 속에 것이다. 원대하고, 청춘 천고에 무엇을 천하를 같이, 것이다. 그러므로 뼈 심장은 것이다.</p> 
    </Wrapper>
  );
};

export default ContentPresentation;